
# === === === === === === === === === === === === === === === === === === === === === === === === === === === #
# В данной лабораторной работе предстоит модернизировать ЭС , реализованную в предыдущей лабораторной работе
# С использованием фреймворка Langchain. В качестве языковой модели можно использовать либо Gigachat API,
# Либо простую модель с Hugging Face (При желании и возможности можно воспользоваться и другими "источниками")
# === === === === === === === === === === === === === === === === === === === === === === === === === === === #

if __name__ == "__main__":

    print("Hello world! It's me.")