# Вопросы для пользователя

questions = [
        { # 1
            "Ключ": "Тип недвижимости", 
            "Значение": "Какой тип недвижимости вас интересует? (Жилой/Коммерческий/Инвестиционный) : "
        },

        { # 2
            "Ключ": "Бюджет", 
            "Значение": "Какую сумму вы готовы потратить на покупку недвижимости? : "
        },

        { # 3
            "Ключ": "Ипотека", 
            "Значение": "Планируете ли вы покупать недвижимость в ипотеку? (Да/Нет) : "
        },

        { # 4
            "Ключ": "Рынок", 
            "Значение" : "Есть ли у вас предпочтения по типу сделки (Первичный/Вторичный рынок)? : "
        },

        { # 5
            "Ключ": "Комнатность", 
            "Значение" : "Сколько комнат вам нужно? : "
        },

        { # 6
            "Ключ": "Этаж", 
            "Значение" : "Есть ли предпочтения по этажу ? (Первый/Последний/Любой) : "
        },

        { # 7
            "Ключ": "Район", 
            "Значение" : "Какой район вы предпочитаете ? (Октябрьский/Ленинский/Советский/Кировский/Пригород/Не важно) : "
        },

        { # 8
            "Ключ": "Парковка", 
            "Значение" : "Необходимо ли вам парковочное место? (Да/Нет) : "
        },

        { # 9
            "Ключ": "Приоритет", 
            "Значение" : "Что для вас важнее ? (Цена/Качество/Местоположение) : "
        },

        { # 10
            "Ключ": "Безопасность", 
            "Значение" : "Важна ли вам безопасность района (охрана, видеонаблюдение, консьерж)? (Да/Нет): "
        }

]


