# Вопросы для пользователя

questions = [
    { 
        "Ключ": "Тип недвижимости", 
        "Вопрос": "Какой тип недвижимости вас интересует? (Жилой/Коммерческий/Инвестиционный) : "
    },

    { 
        "Ключ": "Бюджет", 
        "Вопрос": "Какую сумму (в рублях) вы готовы потратить на покупку недвижимости? : "
    },

    { 
        "Ключ": "Ипотека", 
        "Вопрос": "Планируете ли вы покупать недвижимость в ипотеку? (Да/Нет) : "
    },

    { 
        "Ключ": "Семейное положение", 
        "Вопрос": "Состоите ли вы в браке? (Да/Нет) : "
    },

    { 
        "Ключ": "Количество комнат", 
        "Вопрос": "Сколько комнат вам требуется? (Введите целое число) : "
    },

    { 
        "Ключ": "Расположение", 
        "Вопрос": "Какой район предпочтительнее? (Если не важно нажмите Enter) : "
    }
]
