# Вопросы для пользователя

questions = [

    {
        "Ключ" : "Бюджет",
        "Вопрос" : "Какую сумму (в рублях) вы готовы потратить на покупку недвижимости? : "
    },

    {
        "Ключ" : "Семейное положение",
        "Вопрос" : "Состоит ли вы в каком-либо браке ? : "
    },

    {
        "Ключ" : "Количество детей",
        "Вопрос" : "Есть ли у вас дети? Если да - то сколько ? : "
    },

    {
        "Ключ" : "Инфраструктура",
        "Вопрос" : "Насколько важно для вас наличие развитой инфраструктуры (магазины, школы, поликлиники и т.д.) в шаговой доступности? (Очень важно/Не критично) : "
    }

]