# Вопросы для пользователя

questions = [
        { 
            "Ключ": "Тип недвижимости", 
            "Вопрос": "Какой тип недвижимости вас интересует? (Жилой/Коммерческий/Инвестиционный) : "
        },

        { 
            "Ключ": "Бюджет", 
            "Вопрос": "Какую сумму вы готовы потратить на покупку недвижимости? : "
        },

        { 
            "Ключ": "Ипотека", 
            "Вопрос": "Планируете ли вы покупать недвижимость в ипотеку? (Да/Нет) : "
        },

        { 
            "Ключ": "Семейное положение", 
            "Вопрос": "Состоите ли вы в каком-либо браке? (Да / Нет) : "
        },

]


